modules/Flight/Controllers/FlightController.php

        $data = [
            'rows'               => $list,
            'list_location'      => $this->locationClass::where('status', 'publish')->limit($limit_location)->with(['translation'])->get()->toTree(),
            'seatType'           => SeatType::get(),
---
select * from `bravo_seat_type` where `bravo_seat_type`.`deleted_at` is null